# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Formula install
brew 'bash' # Latest Bash version
brew 'cmake'
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'node'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20d
brew 'tree' # List directories in a tree structure
brew 'vim'
brew 'yarn'

# Cask install
cask 'adguard'
cask 'chromedriver'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'iterm2'
cask 'plex-media-server'
cask 'postman'
cask 'private-internet-access'
cask 'miniconda'
cask 'xquartz'
cask 'r'
cask 'rstudio'
cask 'slack'
cask 'sublime-text'
cask 'transmission'
cask 'typora'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoom'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Amphetamine', id: 937984704
mas 'Final Cut Pro', id: 424389933
mas 'Kindle', id: 405399194
mas 'Magnet', id: 441258766
mas 'Microsoft Excel', id: 462058435
mas 'Microsoft PowerPoint', id: 462062816
mas 'Microsoft Word', id: 462054704